In [2]:
import pandas as pd
import numpy as np
import matplotlib

In [18]:
data = pd.read_csv("Hip_Hop _ Vocab_Chart-Full.csv")

In [19]:
data.head()

,notes,recalc,era,rapper,rapper_clean,color,words,id,source
0,NaN,2988.0,2010s,21 Savage,21 Savage,NaN,2988,21-savage,new
1,NaN,3812.0,2010s,2 Chainz,2 Chainz,NaN,4148,2chainz,poster
2,NaN,3815.0,1990s,2Pac,2Pac,west nowutang second,"3,970",2pac,site
3,NaN,3384.0,2000s,50 Cent,50 Cent,east nowutang first,"3,591",50-cent,site
4,NaN,4534.0,2010s,Ab-Soul,Ab-Soul,NaN,4534,absoul,new

In [4]:
%matplotlib inline

In [20]:
data.groupby('era').agg(['mean', 'count', 'max'])

            recalc
              mean count     max
era
1980s  4207.500000     8  4655.0
1990s  4544.704545    44  6390.0
1999s  4620.000000     1  4620.0
2000s  4633.580000    50  7879.0
2010s  3722.807018    57  5413.0

In [21]:
# because 1999s belongs in 1990s and there is only one entry, going to replace 1999s by 1990s
data.replace('1999s', '1990s', inplace = True)

In [22]:
grp_by_era = data.groupby('era').agg(['mean', 'count', 'max'])
grp_by_era

            recalc
              mean count     max
era
1980s  4207.500000     8  4655.0
1990s  4546.377778    45  6390.0
2000s  4633.580000    50  7879.0
2010s  3722.807018    57  5413.0